[{"_id":"5bfd6f3645646604290681a5","text":"I had to write about Providence Island because looking up about this place i knew trip advisor.\r\nI went on January 2008. Weather good, the island nice to look around in a tour, and the sea wonderful. I stayed at Sol Caribe Campo Hotel, a few minutes from downtown, peaceful, near the beach and with good activities at night. Food was good too, different kinds. I went with my wife, and i recommend this place for a family vacations, beach and sun.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T16:22:14.242Z","updatedAt":"2018-11-27T16:22:14.242Z","__v":0},{"_id":"5bfd709645646604290681ac","text":"The water is AMAZING! I have never seen something like that! The Aquarium and Johnny Cay were beautiful.. Johnny Cay was a little bit crowded for my taste, but beautiful nevertheless.","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T16:28:06.032Z","updatedAt":"2018-11-27T16:28:06.032Z","__v":0},{"_id":"5bfd70c245646604290681ad","text":"Not too good. The lake is just OK with lots of insects that bite and too much garbage. The garbage all over the place, really wrecks this lake. If the Island people want this to be a more popular attraction, they need to clean up the garbage.","author":"5bfcca8f9e6b162bfd81d7ff","createdAt":"2018-11-27T16:28:50.401Z","updatedAt":"2018-11-27T16:28:50.401Z","__v":0},{"_id":"5bfd728945646604290681b3","text":"This place is beautiful but the service in general has a lot to improve. It is very expensive for a short ride in car and canoa and the food they give you in general is very basic. Also the guides don't speak english. Nevertheless the place worth visiting.\r\nTip: You should bring a lot of water since the tours don't provide it.","author":"5bfcca8f9e6b162bfd81d7ff","createdAt":"2018-11-27T16:36:25.699Z","updatedAt":"2018-11-27T16:36:25.699Z","__v":0},{"_id":"5bfd72da45646604290681b6","text":"Caño Cristales is one of the most unique and jaw-droppingly beautiful places I have ever seen. It’s really true - the river plants turn pink, red, and purple in the sun. Just gorgeous. And there are swimming holes everywhere, so every day included some leisure time swimming in the most beautiful settings. \r\nThere are a few things to note: the park does not allow (and checks bags to ensure compliance) sunscreen or bug repellent - that’s part of how they protect the amazingly clear water. So bring a huge floppy hat and cool long-sleeved shirts and long pants. It’s very hot, so be prepared, but TOTALLY worth it.","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T16:37:46.253Z","updatedAt":"2018-11-27T16:37:46.253Z","__v":0},{"_id":"5bfd736f45646604290681b9","text":"Once in a lifetime trip. Cano Cristales is so beautiful. We booked the tour with Impulse Travel. Our guide Diana was excellent and we learnt about the wildlife, ecosystem and people's life in this part of Colombia. The trip is physically demanding but it's worth every effort you put in. We walked a lot in a hot and humid weather but were awarded with a nice swim in Cano Cristales and even smaller river Cano Cristalitos. The most beautiful place!","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T16:40:15.684Z","updatedAt":"2018-11-27T16:40:15.684Z","__v":0},{"_id":"5bfd745945646604290681bd","text":"Are there any Jeep tours or short walks that allow us to see the wax trees? I have a bad hip and the reviews of horse rides make it sound very challenging on horseback. Thanks!","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T16:44:09.479Z","updatedAt":"2018-11-27T16:44:09.479Z","__v":0},{"_id":"5bfd749345646604290681bf","text":"Hello, we are going to Salento next week. Our plan is to do a coffee tour and hike valle de Cocora. Weather forecast is rain. How much rain should I expect? Will I be able to hike el valle if it’s raining?","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T16:45:07.187Z","updatedAt":"2018-11-27T16:45:07.187Z","__v":0},{"_id":"5bfd772845646604290681c3","text":"We been here three years ago and back than it was only worst, so give it another try. \r\nWe did a hike trough the whole park in one day, starting at the main entrance and not taking the collectivo to the beach which is not bad because there are no other people, than trough the park (3-4 hours) and from Cabo San Juan over Pueblito back (3-4 hours). Notice it tooks us 7-7:30 hours with some small breaks to do the hike because the last part is most of the time up hill and there is also climbing included. Be prepared with water wand snacks! So now the park it self is totally overcrowded and the middlepart is not very interesting, the way to the beaches and back are very beautiful. The park management is the worst, you got no information how longe the hike is, there is no advise if you have enough water with you or the right shoes etc etc. So be prepared!","author":"5bfcca8f9e6b162bfd81d7ff","createdAt":"2018-11-27T16:56:08.533Z","updatedAt":"2018-11-27T16:56:08.533Z","__v":0},{"_id":"5bfd778845646604290681ca","text":"Parque Tayrona is an awesome place to hike. Even my kids (10 and 13) had fun. Cool wildlife (birds, fish, snakes) and there are few rules so you can hike where you want. Challenging hikes to beautiful beaches. Amazing workout. Incredible view sand scenery. Professionally managed, police around so you feel safe. Taxi drivers will take you to the entrance and pick you up afterwards. Great day trip from santa marta.","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T16:57:44.347Z","updatedAt":"2018-11-27T16:57:44.347Z","__v":0},{"_id":"5bfd77ba45646604290681cc","text":"Fuimos un grupo de nueve personas, rentamos una casa bastante básica pero suficientemente buena para dormir. La casa estaba a 10 minutos en lancha de la playa más concurrida (Cristal). El paisaje es demasiado hermoso, la playa era prácticamente para nosotros, apenas había olas. NO HAY SEÑAL DE CELULAR, es un perfecto espacio para desconectarse y disfrutar.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T16:58:34.761Z","updatedAt":"2018-11-27T16:58:34.761Z","__v":0},{"_id":"5bfd77da45646604290681cd","text":"Es mejor llevar comida y bebida, los restaurantes que hay en algunas playas son bastantes precarios.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T16:59:06.772Z","updatedAt":"2018-11-27T16:59:14.532Z","__v":0},{"_id":"5bfd793a45646604290681ce","text":"My friend and I had a 4 day trip to Nevado del Tolima organized by Montañas Colombianas. Every aspect provided by them from the guiding to the equipment was excellent. The region presents some incredible landscape at every stage of the route, but the view from the summit of Tolima is of course the crown jewel of the whole experience. Montañas Colombianas was always very helpful with all of our questions before the start of the trip and they will definitely be among my top choices for my next mountaineering trip in Colombia.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T17:04:58.520Z","updatedAt":"2018-11-27T17:04:58.520Z","__v":0},{"_id":"5bfd7a1245646604290681d5","text":"Hi, I was planning on getting on a boat from Cartagena to Playa Blanca as I am staying there for 5 days. Now, I have a 23 KG suitcase and a little carry on suitcase. How does this work? Can I take it on a boat with me or would I be better off getting a shuttle/taxi ?","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T17:08:34.071Z","updatedAt":"2018-11-27T17:08:34.071Z","__v":0},{"_id":"5bfd7a4745646604290681d8","text":"Hola, voy a ir a playa blanca, me gustaría saber cuanto esta costando el viaje con almuerzo en lancha y muy importante si hay lockers o casilleros donde podamos dejar pertenencias de valor, gracias.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T17:09:27.299Z","updatedAt":"2018-11-27T17:09:27.299Z","__v":0},{"_id":"5bfd7aa145646604290681da","text":"The place is just... GREAT! The tourist guides were very friendly and the tour was in spanish and english, the whole explanation was clear and the place is beautiful, you feel like you can touch clouds and heaven. When you get there don't forget to take a picture of your foot in the step 650! Highly recommended!","author":"5bfcca8f9e6b162bfd81d7ff","createdAt":"2018-11-27T17:10:57.080Z","updatedAt":"2018-11-27T17:10:57.080Z","__v":0},{"_id":"5bfd7b0945646604290681e1","text":"A lot of free time to explore, not the most informative but still a good price for them taking you there and you get 2 meals.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T17:12:41.525Z","updatedAt":"2018-11-27T17:12:41.525Z","__v":0},{"_id":"5bfd7f1345646604290681e7","text":"The cable lift affords a long ride and beautiful overview of the canyon and park. There is a 4 mile nature walk that you can do in its entirety, or get picked up by a bus if you get tired. There is also a fun zip line to go on.","author":"5bfcc63a5513e72bb32052ce","createdAt":"2018-11-27T17:29:55.248Z","updatedAt":"2018-11-27T17:29:55.248Z","__v":0},{"_id":"5bfd7f3f45646604290681ea","text":"The only thing worthwhile about the park is the cable car that crosses to Mesa de Los Santos, aside from that it is just a brick and mortar monstrosity built to divorce visitors from their money. Go fly Parapente in the canyon instead.","author":"5bfcca8f9e6b162bfd81d7ff","createdAt":"2018-11-27T17:30:39.000Z","updatedAt":"2018-11-27T17:30:39.000Z","__v":0},{"_id":"5bfd7fc845646604290681ef","text":"I visited the park with friends and had a wonderful time. The restaurant provides excellent Colombian food and the views are stunning to say the least. I visited by car one day and telefetico the next and both visits were awesome.","author":"5bfcc8759e6b162bfd81d7fe","createdAt":"2018-11-27T17:32:56.856Z","updatedAt":"2018-11-27T17:32:56.856Z","__v":0}]